# ZOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..ZOffset Property
StructuralElementDefinitionData Class See Also
---
Z offset.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double ZOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ZOffset As Double
	Get
```

Visual C++
---
```text
public:
property double ZOffset {
	double get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace